package hw1;

public class Homework1 {
	public static void main(String[] args) {
		int x = 12, y = 6;
		System.out.println("12,6的和是" + (x + y) + ",積是" + (x * y));
//=============================================================================================================
		int egg = 200, z = 12;
		System.out.println("共" + (egg / z) + "打");
//=============================================================================================================
		int total = 256559;
		final int d = 24, h = 60, m = 60;
		int totalMin = total / m;
		int totalHr = totalMin / h;
		int totalDay = totalHr / d;
		System.out.println("256559秒=" + totalMin + "分,=" + totalHr + "小時,=" + totalDay + "天");
		System.out.println("剩餘秒是為" + (total % m));
//=============================================================================================================
		final double PI = 3.1415;
		int r = 5;
		System.out.println("半徑5的圓面積為" + (r * r * PI) + ",圓周長為" + (r * 2 * PI));
//=============================================================================================================
		int pv = 1500000, year = 10;
		double ir = 0.02;
		double money = Math.pow(++ir, year);
		System.out.println("總金額為" + (pv + (money * pv)) + "元");
//=============================================================================================================
		System.out.println(5 + 5);// 整數+整數 將數字相加後得到的結果也是整數
		System.out.println(5 + '5');// 整數+字元會自動將字元轉換成「Unicode」的十六進位編碼，並再次轉換成10進位後，於前面的整數相加，最後結果為整數
		System.out.println(5 + "5");// 整數+字串 因有字串的存在Java會將整數與字串直接串接在一起，若有運算式而運算子優先度沒大於+也會被串接起來
	}
}
